data/tests/json/rust_3p_250_5.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      250
Time taken for tests:   12.525 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    399.20 [#/sec] (mean)
Time per request:       626.254 [ms] (mean)
Time per request:       2.505 [ms] (mean, across all concurrent requests)
Transfer rate:          51.07 [Kbytes/sec] received
                        68.61 kb/s sent
                        119.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       20  130  80.3     96    1254
Processing:    33  287 523.2    101    8752
Waiting:       18  285 521.9    101    8752
Total:         53  417 528.6    265    8840

Percentage of the requests served within a certain time (ms)
  50%    265
  66%    353
  75%    403
  80%    465
  90%    723
  95%   1138
  98%   1871
  99%   2878
 100%   8840 (longest request)
Run 2:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      250
Time taken for tests:   11.203 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    446.31 [#/sec] (mean)
Time per request:       560.153 [ms] (mean)
Time per request:       2.241 [ms] (mean, across all concurrent requests)
Transfer rate:          57.10 [Kbytes/sec] received
                        76.71 kb/s sent
                        133.80 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       26  137  86.6    105    1236
Processing:    42  281 477.9    112    8211
Waiting:       28  281 477.6    111    8209
Total:         67  418 485.9    286    8357

Percentage of the requests served within a certain time (ms)
  50%    286
  66%    363
  75%    418
  80%    481
  90%    743
  95%   1129
  98%   1725
  99%   2738
 100%   8357 (longest request)
Run 3:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      250
Time taken for tests:   14.305 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    349.53 [#/sec] (mean)
Time per request:       715.247 [ms] (mean)
Time per request:       2.861 [ms] (mean, across all concurrent requests)
Transfer rate:          44.72 [Kbytes/sec] received
                        60.08 kb/s sent
                        104.79 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       22  154 150.5    118    2053
Processing:    36  399 855.8    122   13936
Waiting:       23  396 854.6    121   13936
Total:         60  553 877.3    295   13995

Percentage of the requests served within a certain time (ms)
  50%    295
  66%    376
  75%    464
  80%    617
  90%   1151
  95%   1855
  98%   3371
  99%   4587
 100%  13995 (longest request)
Run 4:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      250
Time taken for tests:   14.679 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    340.62 [#/sec] (mean)
Time per request:       733.950 [ms] (mean)
Time per request:       2.936 [ms] (mean, across all concurrent requests)
Transfer rate:          43.58 [Kbytes/sec] received
                        58.54 kb/s sent
                        102.12 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       25  137  85.8    109    1646
Processing:    42  298 589.8    115   14309
Waiting:       25  297 587.9    114   14309
Total:         71  436 595.0    288   14454

Percentage of the requests served within a certain time (ms)
  50%    288
  66%    371
  75%    426
  80%    492
  90%    755
  95%   1184
  98%   1838
  99%   2691
 100%  14454 (longest request)
Run 5:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /json
Document Length:        23 bytes

Concurrency Level:      250
Time taken for tests:   14.581 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      655000 bytes
Total body sent:        880000
HTML transferred:       115000 bytes
Requests per second:    342.91 [#/sec] (mean)
Time per request:       729.062 [ms] (mean)
Time per request:       2.916 [ms] (mean, across all concurrent requests)
Transfer rate:          43.87 [Kbytes/sec] received
                        58.94 kb/s sent
                        102.80 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       22  133  74.9    108     930
Processing:    39  279 517.7    113   13770
Waiting:       24  279 517.4    113   13769
Total:         67  413 521.1    286   13852

Percentage of the requests served within a certain time (ms)
  50%    286
  66%    363
  75%    416
  80%    489
  90%    745
  95%   1095
  98%   1624
  99%   2040
 100%  13852 (longest request)